Revit 2027 API
MultiSegmentGrid.GetMultiSegementGridId Method
 Retrieve the element id of the MultiSegmentGrid of which the specified Grid is a member.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId GetMultiSegementGridId(
	Grid grid
)
Public Shared Function GetMultiSegementGridId (
	grid As Grid
) As ElementId
public:
static ElementId^ GetMultiSegementGridId(
	Grid^ grid
)
static member GetMultiSegementGridId :
        grid : Grid -> ElementId
Parameters
grid Grid
 A Grid.
Return Value
ElementId
 The element id of the associated GridChain. If the Grid is not associated to a GridChain, this will return invalidElementId.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MultiSegmentGrid Class
Autodesk.Revit.DB Namespace